betfair/templates/uk/BFExchangeService.updateBets.req.xml

<?xmlversion='1.0'encoding='UTF-8'?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
xmlns:SOAP-ENC='http://schemas.xmlsoap.org/soap/encoding/'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:ns2='http://www.betfair.com/publicapi/types/exchange/v5/'
xmlns:ns1='http://www.betfair.com/publicapi/v5/BFExchangeService/'>
<SOAP-ENV:Body>
<ns1:updateBets>
<ns1:request>
<header>
<sessionToken></sessionToken>
</header>
<bets>
<ns2:UpdateBets>
<betId>0</betId>
<newPrice>0.0</newPrice>
<newSize>0.0</newSize>
<oldPrice>0.0</oldPrice>
<oldSize>0.0</oldSize>
<oldBetPersistenceType>NONE</oldBetPersistenceType>
<newBetPersistenceType>NONE</newBetPersistenceType>
</ns2:UpdateBets>
<ns2:UpdateBets>
<betId>0</betId>
<newPrice>0.0</newPrice>
<newSize>0.0</newSize>
<oldPrice>0.0</oldPrice>
<oldSize>0.0</oldSize>
<oldBetPersistenceType>NONE</oldBetPersistenceType>
<newBetPersistenceType>NONE</newBetPersistenceType>
</ns2:UpdateBets>
</bets>
<header>
<clientStamp>0</clientStamp>
<sessionToken></sessionToken>
</header>
</ns1:request>
</ns1:updateBets>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
